; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	spectrograph0 - mode
	infrared1 - mode
	GroundStation5 - direction
	Star10 - direction
	GroundStation11 - direction
	Star12 - direction
	Star13 - direction
	GroundStation2 - direction
	Star1 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	Star6 - direction
	GroundStation4 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star9)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star6)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
)
(:goal (and
	(pointing satellite0 Phenomenon14)
	(pointing satellite1 Planet15)
	(have_image Phenomenon14 infrared1)
	(have_image Planet15 spectrograph0)
	(have_image Planet16 infrared1)
	(have_image Phenomenon17 infrared1)
	(have_image Star18 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (calibrate satellite1 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 0 of 7
3. (turn_to satellite1 planet16 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet16)
   goals met: 0 of 7
4. (take_image satellite1 planet16 instrument1 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 1 of 7
5. (turn_to satellite1 phenomenon17 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 phenomenon17)
   goals met: 1 of 7
6. (take_image satellite1 phenomenon17 instrument1 infrared1)
   added: (have_image phenomenon17 infrared1)
   goals met: 2 of 7
7. (turn_to satellite1 phenomenon14 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon14)
   goals met: 2 of 7
8. (take_image satellite1 phenomenon14 instrument1 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 3 of 7
9. (turn_to satellite0 phenomenon14 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 7
10. (turn_to satellite1 star18 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 star18)
   goals met: 4 of 7
11. (take_image satellite1 star18 instrument1 spectrograph0)
   added: (have_image star18 spectrograph0)
   goals met: 5 of 7
12. (turn_to satellite1 planet15 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 planet15)
   goals met: 6 of 7
13. (take_image satellite1 planet15 instrument1 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 7 of 7
